# WaveWaveLenMax Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wave..::..WaveWaveLenMax Property
Wave Class See Also
---
The property labeled "Len Max" from the "Wave" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WaveWaveLenMax { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WaveWaveLenMax As String
	Get
```

Visual C++
---
```text
public:
static property String^ WaveWaveLenMax {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
# See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace